{
  "book": "Rich Dad Poor Dad",
  "author_style": "Robert T. Kiyosaki",
  "summary": "Expanded core lessons on money, mindset, and financial independence",
  "lessons": [
    {
      "id": 1,
      "title": "The Rich Don’t Work for Money",
      "content": "Most people are taught to work hard, get a good job, and depend on a paycheck for survival. This creates a cycle where fear of losing money controls decisions. When bills increase, people work harder instead of thinking smarter. The rich understand that chasing money keeps you trapped. Instead, they focus on building systems, businesses, and investments that generate income whether they work or not. True wealth starts when you learn to control fear and stop letting money dictate your life choices."
    },
    {
      "id": 2,
      "title": "Financial Education Matters More Than Academic Education",
      "content": "Traditional education focuses on grades, degrees, and job security, but it rarely teaches how money actually works. Financial education means understanding income statements, balance sheets, cash flow, debt, taxes, and risk. Many highly educated people struggle financially because they never learned these basics. Financial intelligence allows you to spot opportunities others miss, manage losses calmly, and make decisions that compound wealth over time. Without this education, higher income often leads only to higher spending and deeper debt."
    },
    {
      "id": 3,
      "title": "Assets vs. Liabilities Is the Foundation",
      "content": "The difference between rich and poor often comes down to how they define assets and liabilities. An asset puts money into your pocket consistently, while a liability pulls money out. This definition is based on cash flow, not emotions or social beliefs. Many people believe their house is an asset, but if it requires constant payments, it is a liability. The rich focus on acquiring income-generating assets first and let those assets pay for their lifestyle and comforts later."
    },
    {
      "id": 4,
      "title": "Mind Your Own Business",
      "content": "Most people spend their lives focused entirely on their job or profession, believing that loyalty and hard work will lead to security. However, jobs provide income, not freedom. The rich focus on building their own asset column alongside their career. This includes businesses, investments, real estate, or intellectual property. When you mind your own business, you reduce dependence on employers and economic conditions. Financial freedom comes from owning systems, not from climbing corporate ladders."
    },
    {
      "id": 5,
      "title": "Taxes Reward the Financially Smart",
      "content": "The tax system is structured to reward those who understand money, not those who work the hardest. Employees earn income, pay taxes, and then spend what remains. Business owners and investors use money to create value, deduct expenses legally, and then pay taxes on what is left. This is not corruption; it is financial knowledge. Complaining about taxes keeps people stuck, while learning how laws work allows wealth to grow legally and efficiently."
    },
    {
      "id": 6,
      "title": "Risk Is Managed, Not Avoided",
      "content": "Fear of loss is one of the biggest reasons people stay poor. They avoid investing, starting businesses, or learning new skills because they fear failure. The rich experience losses too, but they treat mistakes as education. Losing money is not failure; failing to learn is. Risk can be reduced through education, experience, and smart decision-making. The most dangerous risk is depending entirely on a single source of income."
    },
    {
      "id": 7,
      "title": "Choose Learning Over Security",
      "content": "Job security is temporary and often an illusion, especially in a changing economy. Skills, on the other hand, stay with you for life. The rich prioritize learning skills like sales, communication, leadership, and investing because these skills multiply income opportunities. Instead of asking for raises, they focus on increasing their value. Long-term wealth follows those who continuously learn, adapt, and grow beyond comfort zones."
    }
  ]
}
